<?php if (!defined('FW')) {
    die('Forbidden');
}

$options = [
    'category'    => [
        'label'   => 'Категории',
        'desc'    => 'Выберете категорию для отображения',
        'type'    => 'select',
        'choices' => FW_Shortcode_Blog_Slider::getPostCategories()
    ],
    'amount_news' => [
        'type'  => 'text',
        'value' => '4',
        'label' => __('Количество выводимых новостей', 'fw'),
        'desc'  => __('Сколько новостей хотите отобразить?', 'fw'),
        'help'  => 'Укажите сколько новостей хотите отобразить на странице',
    ],
    'items'        => [
        'label'   => __('ПК версия', 'fw'),
        'desc'    => __('Количество отображаемых элементов в ПК версии', 'fw'),
        'type'    => 'select',
        'value'   => '4',
        'choices' => [
            '1' => __('1', 'fw'),
            '2' => __('2', 'fw'),
            '3' => __('3', 'fw'),
            '4' => __('4', 'fw'),
            '5' => __('5', 'fw'),
            '6' => __('6', 'fw'),
        ]
    ],
    'items-table'  => [
        'label'   => __('Версия для планшета', 'fw'),
        'desc'    => __('Количество отображаемых элементов в версии для планшета', 'fw'),
        'type'    => 'select',
        'value'   => '3',
        'choices' => [
            '1' => __('1', 'fw'),
            '2' => __('2', 'fw'),
            '3' => __('3', 'fw'),
            '4' => __('4', 'fw'),
            '5' => __('5', 'fw'),
        ]
    ],
    'items-mobile' => [
        'label'   => __('Мобильная версия', 'fw'),
        'desc'    => __('Количество отображаемых элементов в мобильной версии', 'fw'),
        'type'    => 'select',
        'value'   => '1',
        'choices' => [
            '1' => __('1', 'fw'),
            '2' => __('2', 'fw'),
            '3' => __('3', 'fw'),
            '4' => __('4', 'fw'),
            '5' => __('5', 'fw'),
        ]
    ],
];
